{
  "Assist": {
    "date": "June 22 2022",
    "type": "Desktop",
    "imgs": [
      "1-Dashboard.jpg",
      "2-Ticket-System.jpg",
      "3-Widget.jpg"
    ],
    "description": "Intelligent virtual assistant / Ticket system built to resolve technical questions and report malfunctioning of the platform where it is implemented.",
    "longDescription": [
      "The UDG (Universidad de Guadalajara) has at its disposal its own system for the financial management of its academic centers known as the SIGI system (Integral Management and Information System).",
      "Unfortunately, the UDG software development team, in addition to their tasks as programmers, also had to be in charge of answering questions and reports on the SIGI platform, which greatly hindered the development of other systems.",
      "The solution given to the previous problem was achieved thanks to the Assist project, which was in charge of attending to the most recurring issues through artificial intelligence and delegating those more complex incidents to technical personnel.",
      "One month after its implementation, the reports sent through means outside the same platform have almost completely ceased, and the user experience of the SIGI system has improved, since the vast majority of problems can be attended immediately instead of waiting hours or days until a technical assistant resolves it for us."
    ],
    "technologies": [
      "React.js",
      "HTML",
      "SCSS/SASS",
      "JavaScript",
      "Socket.io",
      "Docker",
      "Docker-Compose",
      "Laravel",
      "MySQL",
      "Redis",
      "Python",
      "RASA"
    ],
    "color": "#3897c6"
  },
  "Typed": {
    "date": "February 4 2023",
    "type": "Desktop",
    "imgs": [
      "1-Layouts_Dark.gif",
      "2-Layouts_Light.gif",
      "3-Test_Light.gif",
      "4-Test_Dark.gif",
      "5-Analytics-Dark.gif",
      "6-Analytics-Light.gif",
      "7-Reset_Dark.gif",
      "8-Reset_Light.gif"
    ],
    "description": "Minigame to improve typing skills on the computer keyboard using all fingers optimally.",
    "longDescription": [
      "This minigame is a recreation of one of my first web applications (Me-k-no).",
      "This challenge consists of writing the phrases that are displayed on the screen as quickly as possible, in order to improve your skills and dexterity when typing on a computer keyboard using all your fingers.",
      "The reason for creating this web page was to apply my knowledge of all the different technologies related to web development that I have learned over time and compare my progress since that first version back in 2020."
    ],
    "technologies": [
      "React.js",
      "HTML",
      "SCSS/SASS",
      "TypeScript",
      "GitHub Pages"
    ],
    "color": "#D9A1A0"
  },
  "This Cord": {
    "date": "June 30 2022",
    "type": "Desktop",
    "imgs": [
      "1-Login.gif",
      "2-Send_Message.gif",
      "3-Create_Server.gif",
      "4-Send_DM.gif",
      "5-Join_Server.gif"
    ],
    "description": "This Cord is a clone of the famous messaging and video calling application known as Discord.",
    "longDescription": [
      "The first time we demo a messaging application, we usually create something quite simplified, in which there is only one global chat where anyone can communicate and see the messages of the rest.",
      "In my case I went a little further, because I created a system to be able to start conversations privately, that is, Direct Messages (DM). And if that weren't enough, I decided to adopt the interface that Discord uses to practice implementing already established designs."
    ],
    "technologies": [
      "React.js",
      "HTML",
      "SCSS/SASS",
      "JavaScript",
      "Socket.io",
      "Docker",
      "Docker-Compose",
      "Node.js",
      "Express.js"
    ],
    "color": "#B2D2A4"
  },
  "Instantgrams": {
    "date": "April 4 2023",
    "type": "Desktop",
    "imgs": [
      "1-Home.gif",
      "2-Resize.gif",
      "3-Overlay.gif"
    ],
    "description": "Responsive clone of the home page of instagram.",
    "longDescription": [
      "Generally, when learning a backend or frontend library/framework, a CRUD system (Create, Read, Update, Delete) is usually carried out to practice this knowledge. In my case, I preferred to do something a little more original than a simple system that lists the elements from a database.",
      "This web page is a clone of the Instagram home page. The objective of its creation was precisely to practice two new technologies that I had just learned, which were spring-boot for the backend and Angular for the frontend."
    ],
    "technologies": [
      "Angular",
      "HTML",
      "SCSS/SASS",
      "TypeScript",
      "Spring-Boot",
      "Java",
      "MySQL"
    ],
    "color": "#838BC2"
  },
  "3D Projection": {
    "date": "February 10 2022",
    "type": "Desktop",
    "imgs": [
      "1-Cube-Isometric-Camera.gif",
      "2-Cube-Perspective-Camera.gif",
      "3-Pyramid-Isometric-Camera.gif",
      "4-Pyramid-Perspective-Camera.gif"
    ],
    "description": "Simple renderer that let us interact with 3D models on screen.",
    "longDescription": [
      "The most basic part of a game engine is based on rendering both 2D and 3D images. As well as the manipulation of its environment through movement and rotation vectors.",
      "For this program, I decided to create an algorithm capable of representing interconnected vertices in order to form geometric figures in a three-dimensional space.",
      "To manipulate the rotations of our objects on screen, I used Euler angles Instead of Quaternions, because they are much easier to implement, but using this comes with a disadvantage known as Gimbal Lock, which occurs when two rotation vectors overlap, due to the non-commutativity property of matrices multiplications which causes the loss of orientation in one of the axes of our 3D models."
    ],
    "technologies": [
      "Python",
      "Pygame",
      "Numpy",
      "Pandas"
    ],
    "color": "#f4c362"
  },
  "React Native Shop": {
    "date": "November 3 2021",
    "type": "Mobile",
    "imgs": [
      "1-Login.gif",
      "2-Filter.gif",
      "3-Preview.gif",
      "4-Buy.gif",
      "5-Sell.gif",
      "6-Edit.gif"
    ],
    "description": "Ecommerce mobile application simulator.",
    "longDescription": [
      "This was my final project for the web programming course, which was a virtual store simulator, where you can sell and buy items from a list of products.",
      "Originally, this application consulted a backend made with PHP and a MySQL database managed with phpMyAdmin, but for another course I had to use a different database and manager, so I redid the backend with node.js and express along with PostgreSQL."
    ],
    "technologies": [
      "React Native",
      "JavaScript",
      "Node.js",
      "Express.js",
      "PostgreSQL",
      "PHP",
      "MySQL"
    ],
    "color": "#455676"
  },
  "React Native Calculator": {
    "date": "August 18 2021",
    "type": "Mobile",
    "imgs": [
      "1-Layout.jpg"
    ],
    "description": "Simple calculator for mobile devices.",
    "longDescription": [
      "This was my first application for mobile devices, it is a simple calculator, in which I learned the basics of React Native and mobile styling."
    ],
    "technologies": [
      "React Native",
      "JavaScript"
    ],
    "color": "#52ab96"
  },
  "Theam": {
    "date": "November 18 2020",
    "type": "Desktop",
    "imgs": [
      "1-Login.jpg",
      "2-Home.jpg",
      "3-Offer.jpg",
      "4-Schedule.jpg",
      "5-Register.jpg"
    ],
    "description": "School course manager for students and educators.",
    "longDescription": [
      "Theam was one of my first web pages, it was my final project for the software engineering course, in which my team and I had to assume the role of project managers.",
      "We had to interview a third party to plan and implement software that would meet his needs, using project management techniques and agile methodologies.",
      "Finally we ended up doing a redesign of the SIIAU website (Comprehensive University Information and Administration System), obviously it was an unofficial version and it worked as a simulator rather than as a service."
    ],
    "technologies": [
      "React.js",
      "HTML",
      "CSS",
      "JavaScript",
      "Python",
      "Flask",
      "MySQL"
    ],
    "color": "#f7b04d"
  },
  "Neumorphism": {
    "date": "December 13 2020",
    "type": "Desktop",
    "imgs": [
      "1-Clock.gif"
    ],
    "description": "Analog clock with neumorphism styling",
    "longDescription": [
      "Neumorphism is a design style for graphical interfaces that gives users the sensation of relief and smoothness in its visual components.",
      "I created this page to get a little practice building web pages with vanilla JavaScript, HTML, and CSS."
    ],
    "technologies": [
      "HTML",
      "CSS",
      "JavaScript"
    ],
    "color": "#877bab"
  }
}